token = '  '

#####################################################
img_mbank = 'https://imbt.ga/2lF1DfUT5d'
img_sms_bank = 'https://imbt.ga/eI1HMrpw2V'
img_internet_bank = 'https://imbt.ga/CAiuSbJ9U0'
img_plastik_karta= 'https://imbt.ga/rd354HkQpR'
img_pul_otkazma = 'https://imbt.ga/S4SRaivmzK'
######################################################
start_message = """<b>Assalomu alaykum! "Mikrokreditbank" ATB rasmiy telegram boti sizning xizmatingizda.</b>
Iltimos, kerakli tilni tanlang.


<b>Ассалому алейкум! "Микрокредитбанк" ATБ расмий телеграм боти сизнинг хизматингизда.</b>
Илтимос, керакли тилни танланг.

<b>Здравствуйте. Официальный бот АКБ "Микрокредитбанк" к вашему услугу.</b>
Пожалуйста, выберите язык"""
##########################################################
bank_xizmatlari="""
<b>Iltimos, xizmat ko`rsatiluvchi shaxs maqomini tanlang!</b>
"""
bank_xizmatlari_kr="""
<b>Илтимос, хизмат кўрсатиш шахс мақомини танланг!</b>
"""
bank_xizmatlari_ru="""
<b>Пожалуйста, выберите тип Обслуживающего лица!</b>
"""


jismoniy = """
<b>Iltimos, xizmat turini tanlang!</b>
"""
jismoniy_kr = """
<b>Илтимос, хизмат турини танланг!</b>
"""
jismoniy_ru = """
<b>Выберите вид услуг!</b>
"""
pul_otkazmalar_uzb ="""Xalqaro pul o'tkazmalarini milliy valyutada amalga oshiring, xorijiy valyutada qabul qiling. Konvertatsiya qilish uchun vaqt sarflamang.
⠀
Siz uchun qulay bo'lgan pul o'tqizmalari tizimidan foydalaning:
🔸Western Union
🔸Unistream
🔸Contact
🔸Moneygram

"""
pul_otkazmalar_kr ="""KIRIL TEKST
🔸Western Union
🔸Unistream
🔸Contact
🔸Moneygram

"""
pul_otkazmalar_ru ="""Совершайте международные переводы в национальной валюте, принимайте в иностранной. Не тратьте время на конвертацию.
⠀
Воспользуйтесь удобной для вас системой переводов:
🔸Western Union
🔸Unistream
🔸Contact
🔸Moneygram

"""
avtokredit_uzb = """Yillik foiz stavkasi - 36% 
Kredit summasi - BHM 1500 barobarigacha
Kredit muddati - 3 yilgacha
Imtiyoz davri - 6 oy
Omonat to'lovi - 32%
                """
avtokredit_ru = """Годовая процентная ставка - 36% 
Сумма кредита - до 1500 кртаного размера БРВ
Срок кредита - до 3 лет
Льготный период - 6 месяцев
Депозитный платеж - 32%
                """
avtokredit_uzb_kiril = """Йиллик фоиз ставкаси - 36% 
Кредит суммаси - БҲМ 1500 баробаригача
Кредит муддати - 3 йилгача
Имтиёз даври - 6 ой
Омонат тўлови - 32%"""

istemolkredit_uzb = """Kredit summasi - BHM 150 barobarigacha
12 oyga - 30%,
24 oyga - 32%,
36 oyga - 34%
                    """
istemolkredit_uzb_kiril = """Кредит суммаси - БҲМ 150 баробаригача
12 ойга - 30%,
24 ойга - 32%,
36 ойга - 34%"
"""
istemolkredit_ru = """Сумма кредита - до 150 кртаного размера БРВ
на 12 месяцев - 30%,
на 24 месяцев - 32%,
на 36 месяцев - 34%
"""
turizm_uzb = """ICHKI TURIZM:
Yilli foiz stavkasi - 30% 
Kredit summasi - BHM 50 barobarigacha
Kredit muddati - 18 oyga
Imtiyoz davri - 6 oygacha
--------------------------------------
TASHQI TURIZM
Yilli foiz stavkasi - 32% 
Kredit summasi - BHM 150 barobarigacha
Kredit muddati - 24 oyga
Imtiyoz davri - 6 oygacha
                """
turizm_uzb_kiril ="""Ички Туризм:
Йиллик фоиз ставкаси - 30% 
Кредит суммаси - БҲМ 50 баробаригача
Кредит муддати - 18 ойга
Имтиёз даври - 6 ойгача"
--------------------------------------
Ташқи Туризм:
Йиллик фоиз ставкаси - 32% 
Кредит суммаси - БҲМ 150 баробаригача
Кредит муддати - 24 ойга
Имтиёз даври - 6 ойгача

"""
turizm_ru = """Внутренный туризм:
Годовая процентная ставка - 30% 
Сумма кредита - до 50 кртаного размера БРВ
Срок кредита - 18 месяцев
Льготный период - до 6 месяцев
-------------------------------------------
Внешный туризм:
Годовая процентная ставка - 32% 
Сумма кредита - до 150 кртаного размера БРВ
Срок кредита - 24  месяцев
Льготный период - до 6 месяцев
"""
mikroqarz_uzb = """Mikroqarz:
Kredit summasi - BHM 100 barobarigacha
Kredit muddati - 1 yilga
Yillik foiz stavkasi:
Naqdsiz shaklda - 34%
Naqd shaklda - 36%
--------------------------------------------
Mikroqarz Online:
Kredit summasi - BHM 50 barobarigacha
Kredit muddati - 3 oygacha
Yillik foiz stavkasi - 36%
"""
mikroqarz_uzb_kiril = """Микроқарз:
Кредит суммаси - БҲМ 100 баробаригача
Кредит муддати - 1 йилга
Йиллик фоиз:
Нақдсиз шаклда - 34%
Нақд шаклда - 36%
----------------------------------------
Микроқарз Онлайн:
Кредит суммаси - БҲМ 50 баробаригача
Кредит муддати - 3 ойгача
Йиллик фоиз ставкаси - 36%
"""
mikroqarz_ru = """Микрозайм:
Сумма кредита - до 100 кртаного размера БРВ
Срок кредита - на 1 год
Годовая процентная ставка:
Безналичной форме - 34%
Наличной форме - 36%
--------------------------------------------
Микрозайм Онлайн:
Сумма кредита - до 50 кртаного размера БРВ
Срок кредита - до 3 месяцев
Годовая процентная ставка - 36%
"""

overdraft_uzb = """Yilli foiz stavkasi - 24%
Kredit summasi - Ўртача ойлик иш ҳақининг 3 бараваригача
Kredit muddati - 1 yilgacha"""
overdraft_uzb_kiril="""Йиллик фоиз ставкаси - 24%
Кредит суммаси - Ўртача ойлик иш ҳақининг 3 бараваригача
Кредит муддати - 1 йилгача
"""
overdraft_ru = """Годовая процентная ставка - 24%
Сумма кредита - до 3 кратного размера среднемесячной зарплаты
Срок кредита -  до 1 года
"""

internet_uzb = """"UZB TEKST"""
internet_kr = """KIRIL TEKST"""
internet_ru = """RUST TEKST"""

sms_banking_uz = """SMS banking UZ"""
sms_banking_ru = """SMS banking RU"""
sms_banking_kr = """SMS Banking Kiril"""

jamgarma_omonat_uzb="""Kundan kun yaxshi:
Muddati - 5,10,15,20,25 va 30 kun
Foizi - 17%
Boshlang'ich badal:
Bankka kelib - 100 000 so'mdan
MKB Online - 100 000 so'mdan
------------------------------------------
Muddati - 35,40,45,50,55 va 60 kun
Foizi - 18%
Boshlang'ich badal:
Bankka kelib - 100 000 so'mdan
MKB Online - 100 000 so'mdan
-------------------------------------------
Muddati - 65,70,75,80,85 va 90 kun
Foizi - 21%
Boshlang'ich badal:
Bankka kelib - 100 000 so'mdan
MKB Online - 100 000 so'mdan
--------------------------------------------
Baxtli bolalik:
Muddati - 1 yildan 15 yilgacha
Bankka kelib:
Foizi: - 10%
Boshlang'ich badal - cheklanmagan
MKB Online:
Foizi: - 10%
Boshlang'ich badal - 100 000 so'mdan
                    """
jamgarma_omonat_uzb_kiril="""Кундан кун яхши:
Муддати - 5,10,15,20,25 ва 30 кун
Фоизи - 17%
Бошланғич бадал:
Банкка келиб - 100 000 сўмдан
МКБ Онлайн - 100 000 сўмдан
----------------------------------------------
Муддати - 35,40,45,50,55 ва 60 кун
Фоизи - 18%
Бошланғич бадал:
Банкка келиб - 100 000 сўмдан
МКБ Онлайн - 100 000 сўмдан
-----------------------------------------------
Муддати - 65,70,75,80,85 ва 90 кун
Фоизи - 21%
Бошланғич бадал:
Банкка келиб - 100 000 сўмдан
МКБ Онлайн - 100 000 сўмдан
-----------------------------------------------
Бахтли болалик:
Муддати - 1 йилдан 15 йилгача
Банкка келиб:
Фоизи: - 10%
Бошланғич бадал - чекланмаган
МКБ Онлайн:
Фоизи: - 10%
Бошланғич бадал - 100 000 сўмдан
"""
jamgarma_omonat_ru="""Кундан кун яхши:
Срок - 5,10,15,20,25 и 30 кун
Процентная ставка - 17%
Первоначальный взнос:
приходя в банк - от 100 000 сум
МКБ Онлайн - от 100 000 сум
-----------------------------------------
Срок - 35,40,45,50,55 и 60 кун
Процентная ставка - 18%
Первоначальный взнос:
приходя в банк - от 100 000 сум
МКБ Онлайн - от 100 000 сум
------------------------------------------
Срок - 65,70,75,80,85 и 90 кун
Процентная ставка - 21%
Первоначальный взнос:
приходя в банк - от 100 000 сум
МКБ Онлайн - от 100 000 сум
-------------------------------------------
Бахтли болалик:
Срок - от 1 до 15 лет
приходя в банк:
Процентная ставка: - 10%
Первоначальный взнос - неограниченный
МКБ Онлайн:
Процентная ставка: - 10%
Первоначальный взнос - от 100 000 сум
"""
mudatli_omonat_uzb = """Barqaror:
Muddati - 12, 24 va 36 oyga
Bankka kelib:
Foizi: - 20%
Boshlang'ich badal - 5 000 000 so'mdan
MKB Online:
Foizi: - 21%
Boshlang'ich badal - 1 000 000 so'mdan
-----------------------------------------
Ravnaq:
Muddati - 12 oyga
Bankka kelib:
Foizi: - 23%
Boshlang'ich badal - 500 000 so'mdan
MKB Online:
Foizi: - 23%
Boshlang'ich badal - 500 000 so'mdan
                         """
mudatli_omonat_uzb_kiril=""""Барқарор:
Муддати - 12, 24 ва 36 ойга
Банкка келиб:
Фоизи: - 20%
Бошланғич бадал - 5 000 000 сўмдан
МКБ Онлайн:
Фоизи: - 21%
Бошланғич бадал - 1 000 000 сўмдан
------------------------------------------
Равнақ:
Муддати - 12 ойга
Банкка келиб:
Фоизи: - 23%
Бошланғич бадал - 500 000 сўмдан
МКБ Онлайн:
Фоизи: - 23%
Бошланғич бадал - 500 000 сўмдан
"""
mudatli_omonat_ru="""Барқарор:
Срок - 12, 24 и 36 месяцев
приходя в банк:
Процентная ставка: - 20%
Первоначальный взнос - от 5 000 000 сум
МКБ Онлайн:
Процентная ставка: - 21%
Первоначальный взнос - от 1 000 000 сум
-----------------------------------------
Равнақ:
Срок - 12 месяцев
приходя в банк:
Процентная ставка: - 23%
Первоначальный взнос - от 500 000 сум
МКБ Онлайн:
Процентная ставка: - 23%
Первоначальный взнос - от 500 000 сум
"""
horijoy_valyutaomonat_uzb="""Eksklyuziv:
Muddati - 3 va 6 oy
Bankka kelib:
Foizi: - 3%
Boshlang'ich badal - 500 AQSH dollari
-------------------------------------------
Profit:
Muddati - 12 va 24 oy
Bankka kelib:
Foizi: - 5% va 6%
Boshlang'ich badal - 500 AQSH dollari
                            """
horijoy_valyutaomonat_uzb_kiril="""Эксклюзив:
Муддати - 3 ва 6 ой
Банкка келиб:
Фоизи: - 3%
Бошланғич бадал - 500 АҚШ доллари
-----------------------------------------------
Профит:
Муддати - 12 ва 24 ой
Банкка келиб:
Фоизи: - 5% ва 6%
Бошланғич бадал - 500 АҚШ доллари
"""
horijoy_valyutaomonat_ru="""Эксклюзив:
Срок - 3 и 6 месяцев
приходя в банк:
Процентная ставка: - 3%
Первоначальный взнос - от 500 долларов США
---------------------------------------------
Профит:
Срок - 12 и 24 месяцев
приходя в банк:
Процентная ставка: - 5% и 6%
Первоначальный взнос - от 500 долларов США
"""
plastik_kr = """TEKST KIRIL"""
plastik = """TEKST UZB
"""
plastik_ru = """TEKST RU"""

mobilbank_kr="""“Mikrokreditbank” ATB tizimida jismoniy shaxslar uchun “Mobile Banking” xizmat turi ishga tushirildi.
Bunda mijoz mobil telefon apparati orqali istalgan joydan o‘z hisob raqamini boshqarishi va nazorat qilishi mumkin.
"""
mobilbank_uzb = """UZB TEKST YOZING"""

mobilbank_ru = """ RUS TEKST YOZING
"""


sberbank_uzb="""Shahar: Moskva
Valyuta/Hisob raqami
USD - 30111840800000001631
EUR - 30111978400000001631
RUB - 30111810500000001631
SWIFT kodi: SABRRUMM
"""
sberbank_kr="""Шахар: Москва
Валюта/Ҳисоб рақами:
USD - 30111840800000001631
EUR - 30111978400000001631
RUB - 30111810500000001631
SWIFT коди: SABRRUMM
"""
sberbank_ru="""Город: Москва
Валюта/Номер счета:
USD - 30111840800000001631
EUR - 30111978400000001631
RUB - 30111810500000001631
SWIFT код: SABRRUMM
"""

rosselxozbank_uzb="""Shahar: Moskva
Valyuta/Hisob raqami
USD - 30111840600000000007
EUR - 30111978000000000003
RUB - 30111810600000000011
SWIFT kodi: RUAGRUMM
"""
rosselxozbank_kr="""Шахар: Москва
Валюта/Ҳисоб рақами:
USD - 30111840600000000007
EUR - 30111978000000000003
RUB - 30111810600000000011
SWIFT коди: RUAGRUMM
"""
rosselxozbank_ru="""Город: Москва
Валюта/Номер счета:
USD - 30111840600000000007
EUR - 30111978000000000003
RUB - 30111810600000000011
SWIFT код: RUAGRUMM
"""

aziyainvestbank_uzb="""Shahar: Moskva
Valyuta/Hisob raqami
USD - 30111840800000002920
EUR - 30111978400000002920
RUB - 30111810500000002920
SWIFT kodi: ASIJRUMM
"""
aziyainvestbank_kr="""Шахар: Москва
Валюта/Ҳисоб рақами:
USD - 30111840800000002920
EUR - 30111978400000002920
RUB - 30111810500000002920
SWIFT коди: ASIJRUMM
"""
aziyainvestbank_ru="""Город: Москва
Валюта/Номер счета:
USD - 30111840800000002920
EUR - 30111978400000002920
RUB - 30111810500000002920
SWIFT код: ASIJRUMM
"""
transkapitalbank_uzb="""Shahar: Moskva
Valyuta/Hisob raqami
USD - 30111840400000000221
EUR - 30111978000000000221
RUB - 30111810100000000221
SWIFT kodi: TJSCRUMM
"""
transkapitalbank_kr="""Шахар: Москва
Валюта/Ҳисоб рақами:
USD - 30111840400000000221
EUR - 30111978000000000221
RUB - 30111810100000000221
SWIFT коди: TJSCRUMM
"""
transkapitalbank_ru="""Город: Москва
Валюта/Номер счета:
USD - 30111840400000000221
EUR - 30111978000000000221
RUB - 30111810100000000221
SWIFT код: TJSCRUMM
"""

milliybank_uzb="""Shahar: Toshkent
Valyuta/Hisob raqami
USD - 21002840100000433002
EUR - 21002978900000433002
RUB - 21002643100000433002
GBP - 21002826500000433002
JPY - 21002392700000433001
KZT - 21002398000000433002
SWIFT kodi: NBFAUZ2X
"""
milliybank_kr="""Шахар: Тошкент
Валюта/Ҳисоб рақами:
USD - 21002840100000433002
EUR - 21002978900000433002
RUB - 21002643100000433002
GBP - 21002826500000433002
JPY - 21002392700000433001
KZT - 21002398000000433002
SWIFT коди: NBFAUZ2X
"""
milliybank_ru="""Город: Ташкент
Валюта/Номер счета:
USD - 21002840100000433002
EUR - 21002978900000433002
RUB - 21002643100000433002
GBP - 21002826500000433002
JPY - 21002392700000433001
KZT - 21002398000000433002
SWIFT код: NBFAUZ2X
"""

ipakyulibank_uzb="""Shahar: Toshkent
Valyuta/Hisob raqami
USD - 21002840100000433001
EUR - 21002978900000433001
RUB - 21002643100000433001
GBP - 21002826500000433001
SWIFT kodi: INIPUZ22
"""
ipakyulibank_kr="""Шахар: Тошкент
Валюта/Ҳисоб рақами:
USD - 21002840100000433001
EUR - 21002978900000433001
RUB - 21002643100000433001
GBP - 21002826500000433001
SWIFT коди: INIPUZ22
"""
ipakyulibank_ru="""Город: Ташкент
Валюта/Номер счета:
USD - 21002840100000433001
EUR - 21002978900000433001
RUB - 21002643100000433001
GBP - 21002826500000433001
SWIFT код: INIPUZ22
"""

uzsanoatbank_uzb="""Shahar: Toshkent
Valyuta/Hisob raqami
USD - 21002840300000433001
SWIFT kodi: UJSIUZ22
"""
uzsanoatbank_kr="""Шахар: Тошкент
Валюта/Ҳисоб рақами:
USD - 21002840300000433001
SWIFT коди: UJSIUZ22
"""
uzsanoatbank_ru="""Город: Ташкент
Валюта/Номер счета:
USD - 21002840300000433001
SWIFT код: UJSIUZ22
"""

hunarmad_kredit_uz = """UZB TEKST"""
hunarmad_kredit_kr = """KIRIL TEKST"""
hunarmad_kredit_ru = """RU TEKST"""

savdo_kredit_uzb = """UZB TEKST"""
savdo_kredit_kr = """KR TEKST"""
savdo_kredit_ru = """RU TEKST"""

mikrokreditlar_yur_uzb = """UZB TEKST"""
mikrokreditlar_yur_kr = """KIRIL TEKST"""
mikrokreditlar_yur_ru= """RU TEKST"""

kollej_uzb="""UZB TEKST"""
kollej_ru="""RU TEKST"""
kollej_kr="""KIRIL TEKST"""

modilbank_yur_uzb="""UZB """
modilbank_yur_kr="""kiril """
modilbank_yur_ru="""ru """




